InformationRegisters/ИсторияМонтажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияМонтажа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Монтаж</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписиВМобильномПриложении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияМонтажа/Ext/ManagerModule.bsl
Процедура ДобавитьЗаписьВИсторию(Монтаж, Дата, Пользователь, ИДЗаписи, Текст) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияМонтажа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Монтаж.Установить(Монтаж); 
	НаборЗаписей.Отбор.Дата.Установить(Дата); 
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь); 
	НаборЗаписей.Отбор.ИДЗаписи.Установить(ИДЗаписи); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Монтаж = Монтаж; 
	НоваяЗапись.Дата = Дата;
	НоваяЗапись.Пользователь = Пользователь;	
	НоваяЗапись.ИДЗаписи = ИДЗаписи;
	НоваяЗапись.Комментарий = Текст;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
